---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.AnalyticalMember
source: html/6c5e4d3f-8271-6c12-a9da-695416364cc3.htm
---
# AnalyticalMember Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.